![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

#### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.\
Salve os dados em uma variável de nome *users*.

#### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [5]:
import pandas as pd
url = 'https://raw.githubusercontent.com/Ed-lab1/data-manipulation-exercises/master/datasets/users_dataset.csv'
users = pd.read_csv(url, sep = '|')

In [6]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [57]:
users[users.occupation == 'writer'].age.mean()

36.31111111111111

In [65]:
users_max_min['max age'] = users[['occupation', 'age']].groupby(['occupation']).max()

In [66]:
users_max_min.head()

               age  max age
occupation
administrator   70       70
artist          48       48
doctor          64       64
educator        63       63
engineer        70       70

In [68]:
users_max_min['min age'] = users[['occupation', 'age']].groupby(['occupation']).min()

In [71]:
users_max_min.drop('age', 1)

               max age  min age
occupation
administrator       70       21
artist              48       19
doctor              64       28
educator            63       23
engineer            70       22
entertainment       50       15
executive           69       22
healthcare          62       22
homemaker           50       20
lawyer              53       21
librarian           69       23
marketing           55       24
none                55       11
other               64       13
programmer          63       20
retired             73       51
salesman            66       18
scientist           55       23
student             42        7
technician          55       21
writer              60       18

#### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [73]:
users_occup_gender = users[['occupation', 'gender', 'age']].groupby(['occupation', 'gender']).mean()

In [75]:
users_occup_gender.head(10)

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000

#### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [97]:
users.groupby('occupation')['gender'].value_counts()

occupation     gender
administrator  M          43
               F          36
artist         M          15
               F          13
doctor         M           7
educator       M          69
               F          26
engineer       M          65
               F           2
entertainment  M          16
               F           2
executive      M          29
               F           3
healthcare     F          11
               M           5
homemaker      F           6
               M           1
lawyer         M          10
               F           2
librarian      F          29
               M          22
marketing      M          16
               F          10
none           M           5
               F           4
other          M          69
               F          36
programmer     M          60
               F           6
retired        M          13
               F           1
salesman       M           9
               F           3
scientist      M          28
               F           3
student        M         136
               F          60
technician     M          26
               F           1
writer         M          26
               F          19
Name: gender, dtype: int64

In [86]:
users[['occupation', 'gender']].groupby(['occupation'])

In [88]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [93]:
colunas = ['occupation','gender']
users[((users.age >=30) & (users.age <= 50)) & (users.occupation.isin(['writer', 'other']))][colunas].head()

   occupation gender
4       other      F
10      other      F
17      other      F
27     writer      M
82      other      M

**Parabéns! Você chegou ao fim!**